#ifndef PSTAT_H
#define PSTAT_H

#define NPROC 64 //μέγιστος αριθμός διεργασιών 

struct pstat{
    int isused[NPROC];   //πίνακας που κρατάει 1 για τις διεργασίες που χρησιμοποιούνται και 0 για τις υπόλοιπες
    int pid[NPROC];  //πίνακας που κρατάει τα id των διεργασιών
    int ppid[NPROC]; //πίνακας που κρατάει τα id των parent διεργασιών 
    char pname[NPROC][16];   //πίνακας που κρατάει τα ονόματα των διεργασιών
    int priority[NPROC]; //πίνκακας που κρατάει τη προτεραιότητα της κάθε διεργασίας
    int pstate[NPROC];   //πίνακας που κρατάει τη κατάσταση που είναι η κάθε διεργασία
    int memsize[NPROC];  //μέγεθος μνήμης για κάθε διεργασία 
};

#endif